Австралия/src/AccumulationRegisters/SubcontractComponents/SubcontractComponents.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>SubcontractComponents</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>SubcontractorOrder</name>
    <type>
      <types>DocumentRef.SubcontractorOrderIssued</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Catalogs/Products/Products.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Products</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccountingMethod</name>
    <type>
      <types>EnumRef.InventoryValuationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>BundleDisplayInPrintForms</name>
    <type>
      <types>EnumRef.ProductBundleDisplay</types>
    </type>
  </attributes>
  <attributes>
    <name>BundlePricingStrategy</name>
    <type>
      <types>EnumRef.ProductBundlePricingStrategy</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </attributes>
  <attributes>
    <name>Cell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ConversionRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CountryOfOrigin</name>
    <type>
      <types>CatalogRef.WorldCountries</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpensesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>GuaranteePeriod</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HSCode</name>
    <type>
      <types>CatalogRef.HSCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>InventoryGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>IsBundle</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsFreightService</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Manufacturer</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>MeasurementUnit</name>
    <type>
      <types>CatalogRef.UOMClassifier</types>
    </type>
  </attributes>
  <attributes>
    <name>OrderCompletionDeadline</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PictureFile</name>
    <type>
      <types>CatalogRef.ProductsAttachedFiles</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceGroup</name>
    <type>
      <types>CatalogRef.PriceGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>PricingBalanceMax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PricingBalanceMin</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProductCrossReference</name>
    <type>
      <types>CatalogRef.SuppliersProducts</types>
    </type>
  </attributes>
  <attributes>
    <name>UseDefaultCrossReference</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsCategory</name>
    <type>
      <types>CatalogRef.ProductsCategories</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsType</name>
    <type>
      <types>EnumRef.ProductsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ReplenishmentDeadline</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReplenishmentMethod</name>
    <type>
      <types>EnumRef.InventoryReplenishmentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>ReportUOM</name>
    <type>
      <types>CatalogRef.UOMClassifier</types>
    </type>
  </attributes>
  <attributes>
    <name>SKU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Specification</name>
    <type>
      <types>CatalogRef.BillsOfMaterials</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeNorm</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseBatches</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseCharacteristics</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSerialNumbers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WriteOutTheGuaranteeCard</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Taxable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShelfLife</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Subcontractor</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessGroup</name>
    <type>
      <types>CatalogRef.ProductAccessGroupsForExternalUsers</types>
    </type>
  </attributes>
  <attributes>
    <name>VisibleToExternalUsers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/AccumulationRegisters/SubcontractComponents/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
		Or Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	SubcontractComponents.LineNumber AS LineNumber,
	|	SubcontractComponents.Products AS Products,
	|	SubcontractComponents.Characteristic AS Characteristic,
	|	SubcontractComponents.SubcontractorOrder AS SubcontractorOrder,
	|	SubcontractComponents.Quantity AS QuantityBeforeWrite,
	|	SubcontractComponents.Quantity AS QuantityChange,
	|	SubcontractComponents.Quantity AS QuantityOnWrite
	|INTO RegisterRecordsSubcontractComponentsChange
	|FROM
	|	AccumulationRegister.SubcontractComponents AS SubcontractComponents");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsSubcontractComponentsChange", False);
	
EndProcedure

Function BalancesControlQueryText() Export
	
	Return
	"SELECT ALLOWED
	|	RegisterRecordsSubcontractComponentsChange.LineNumber AS LineNumber,
	|	RegisterRecordsSubcontractComponentsChange.SubcontractorOrder AS SubcontractorOrder,
	|	RegisterRecordsSubcontractComponentsChange.Products AS Products,
	|	CatalogProducts.MeasurementUnit AS MeasurementUnit,
	|	RegisterRecordsSubcontractComponentsChange.Characteristic AS Characteristic,
	|	RegisterRecordsSubcontractComponentsChange.QuantityChange + ISNULL(SubcontractComponentsBalances.QuantityBalance, 0) AS QuantityBalanceBeforeChange,
	|	ISNULL(SubcontractComponentsBalances.QuantityBalance, 0) AS QuantityBalance
	|FROM
	|	RegisterRecordsSubcontractComponentsChange AS RegisterRecordsSubcontractComponentsChange
	|		LEFT JOIN Catalog.Products AS CatalogProducts
	|		ON RegisterRecordsSubcontractComponentsChange.Products = CatalogProducts.Ref
	|		LEFT JOIN AccumulationRegister.SubcontractComponents.Balance(&ControlTime, ) AS SubcontractComponentsBalances
	|		ON RegisterRecordsSubcontractComponentsChange.SubcontractorOrder = SubcontractComponentsBalances.SubcontractorOrder
	|			AND RegisterRecordsSubcontractComponentsChange.Products = SubcontractComponentsBalances.Products
	|			AND RegisterRecordsSubcontractComponentsChange.Characteristic = SubcontractComponentsBalances.Characteristic
	|WHERE
	|	ISNULL(SubcontractComponentsBalances.QuantityBalance, 0) < 0
	|
	|ORDER BY
	|	LineNumber";
	
EndFunction

#EndRegion

#EndIf
